[{"content":"On Truth Social, former President Trump reveals that he has been indicted by Jack Smith's special counsel over mishandling of classified documents found at the FBI search of Mar-a-Lago.","date":"June 8","sources":["https://www.bbc.com/news/world-us-canada-65852062"]},{"content":"The Supreme Court rules that the state of Alabama must redraw its congressional map because the districts violate section 2 of the Voting Rights Act of 1965 since they racially discriminate against African Americans in the state.","date":"June 8","sources":["https://www.nbcnews.com/politics/supreme-court/supreme-court-strikes-alabama-congressional-map-voting-rights-dispute-rcna64476"]},{"content":"CNN CEO Chris Licht departs the network after a 15,000 word profile disgracing Licht was published in The Atlantic.","date":"June 7","sources":["https://www.cnn.com/2023/06/07/media/chris-licht-cnn/index.html"]},{"content":"North Dakota governor Doug Burgum announces his candidacy for President.","date":"June 7","sources":["https://www.politico.com/news/2023/06/07/north-dakota-doug-burgum-presidential-bid-00100715"]},{"content":"Former Vice President Mike Pence announces his candidacy for President.","date":"June 7","sources":["https://www.nbcnews.com/politics/2024-election/mike-pence-launches-2024-gop-presidential-bid-rcna85844"]},{"content":"A shooting takes place at the Altria Theater in Richmond, Virginia after a graduation ceremony, killing two.","date":"June 6","sources":[]},{"content":"Former New Jersey governor Chris Christie announces his candidacy for President.","date":"June 6","sources":["https://www.nytimes.com/2023/06/06/us/politics/chris-christie-2024-presidential-candidate.html"]},{"content":"Wildfires in Quebec cause the air quality to deteriorate in the Northeast and part of the Midwest. Millions of Americans and Canadians are advised to wear N95 masks.","date":"June 6","sources":["https://www.bbc.co.uk/news/world-us-canada-65828469","https://www.nytimes.com/live/2023/06/06/us/canada-wildfires-smoke-air-quality"]},{"content":"Apple unveils a mixed-reality headset called the Vision Pro, its first new product category since the Apple Watch in 2015. The device is noted for its expected retail price of $3,499 that is considerably higher than other VR and AR headsets on the market.","date":"June 5","sources":["https://www.bbc.co.uk/news/technology-65809408"]},{"content":"The state of Oklahoma approves the first ever religious charter school in the United States.","date":"June 5","sources":["https://www.politico.com/news/2023/06/05/oklahoma-approves-public-religious-charter-school-00100269"]}]