[{"content":"In the largest incursion by Israel into the West Bank since the Second Intifada, the Israeli military deploys ground forces and armed drones into the Jenin camp, killing 13 and injuring more than 100. An attack claimed by Hamas as retaliation for the incursion, occurrs in Tel Aviv the following day, injuring nine.","date":"July 3","sources":["https://www.theguardian.com/world/2023/jul/03/palestinians-killed-israeli-strike-west-bank-jenin","https://www.theguardian.com/world/2023/jul/04/seven-injured-in-tel-aviv-ramming-and-stabbing-attack"]},{"content":"Tajikistani citizen Rustam Ashurov, affiliated with ISIS and wanted in Tajikistan for the kidnapping and murder of the deputy chairman of a bank in the capital Dushanbe, kills two people on the Chișinău International Airport after he was denied entry in the Republic of Moldova, after he arrived on a plane from Turkey.","date":"June 30","sources":["https://www.bbc.com/news/world-europe-66070461",null]},{"content":"Russian invasion of Ukraine: The Wagner Group, led by Yevgeny Prigozhin, begins an armed conflict with the Russian military, seizing the city of Rostov-on-Don and portions of the Voronezh Oblast before withdrawing the next day, after a peace agreement brokered by Belarusian President Alexander Lukashenko.","date":"June 23","sources":["https://www.cbsnews.com/news/wagner-chief-prigozhin-russia-truce-brokered-by-belarus/"]},{"content":"Titan submersible implosion: All five crew members of Titan, a deep-sea submersible exploring the wreck of the Titanic, are killed following a catastrophic implosion of the vessel.","date":"June 18","sources":["https://www.bbc.co.uk/news/live/world-us-canada-65967464"]},{"content":"At least 80 people die and 500 are reported missing after a boat carrying migrants capsizes off the coast of the Peloponnese.","date":"June 14","sources":["https://www.aljazeera.com/news/2023/6/14/seventeen-dead-after-boat-carrying-migrants-capsizes-off-greece"]},{"content":"Scientists report the creation of the first synthetic human embryo from stem cells, without the need for sperm or egg cells.","date":"June 14","sources":["https://www.theguardian.com/science/2023/jun/14/synthetic-human-embryos-created-in-groundbreaking-advance"]},{"content":"At least 103 people are killed when a wedding boat capsizes on the Niger River in Kwara State, Nigeria.","date":"June 13","sources":["https://news.sky.com/story/nigeria-at-least-100-people-killed-after-boat-capsizes-12901819"]},{"content":"Russian invasion of Ukraine: The Nova Kakhovka dam in the Russian-controlled region of Kherson is destroyed, threatening the region with devastating floodwaters.","date":"June 6","sources":["https://www.bbc.co.uk/news/live/world-europe-65816109","https://www.theguardian.com/world/live/2023/jun/06/russia-ukraine-war-live-dam-near-kherson-blown-up-by-russian-forces-ukrainian-military-says"]},{"content":"A train collision in Odisha, India results in at least 294 deaths and 1,175 others injured.","date":"June 2","sources":["https://www.reuters.com/world/india/least-30-dead-179-injured-train-collision-eastern-india-reports-2023-06-02/"]},{"content":"The second round of the 2023 Turkish presidential election is held; Recep Tayyip Erdoğan defeats Kemal Kılıçdaroğlu with 52.18% of the vote to win a third term as president.","date":"May 28","sources":["https://www.cnn.com/2023/05/28/europe/turkey-president-runoff-polls-erdogan-intl/index.html"]}]