[{"content":"A spokesman for Sarah, Duchess of York says that she is recovering following surgery for breast cancer at King Edward VII's Hospital a few days earlier.","date":"25 June","sources":["https://www.bbc.co.uk/news/uk-66014781"]},{"content":"A national technical fault affects the 999 service, meaning emergency services are unable to receive calls for around two hours.","date":"25 June","sources":["https://www.bbc.co.uk/news/uk-66012340"]},{"content":"The UK government holds an emergency COBRA meeting to discuss the Wagner Group rebellion in Russia. Sunak urges both sides to \"be responsible and to protect civilians\".","date":"24 June","sources":["https://www.bbc.co.uk/news/uk-politics-66008543"]},{"content":"Following a trial at Northampton Crown Court, Louis De Zoysa is convicted of the 2020 murder of police sergeant Matt Ratana.","date":"23 June","sources":["https://www.bbc.co.uk/news/uk-england-london-65975164"]},{"content":"Junior doctors in England announce a new five-day walkout from 13 to 18 July – the longest strike yet – over pay.","date":"23 June","sources":["https://www.bbc.co.uk/news/health-65998528"]},{"content":"Banks and building societies are summoned for a meeting with Jeremy Hunt as pressure grows on them to help people struggling with rising mortgage costs. A series of measures are agreed, offering more flexibility.","date":"23 June","sources":["https://www.theguardian.com/business/2023/jun/23/jeremy-hunt-meets-uks-biggest-lenders-in-effort-to-quell-mortgage-crisis","https://www.bbc.co.uk/news/business-65990833"]},{"content":"The RMT announces three fresh days of strike action for 20, 22 and 29 July.","date":"22 June","sources":["https://www.bbc.co.uk/news/business-65986714"]},{"content":"The Bank of England raises the official bank rate from 4.5% to 5%, the 13th consecutive rise, and a greater increase than economists had expected.","date":"22 June","sources":["https://www.bbc.co.uk/news/business-65982981"]},{"content":"UK inflation figures for May 2023 show it remained higher than expected, at 8.7%.","date":"21 June","sources":["https://www.bbc.co.uk/news/business-65966723"]},{"content":"British businessmen Hamish Harding and Shahzada Dawood, along with Dawood's son, Suleman, are confirmed as being aboard the  missing submersible that disappeared during a voyage to see the wreck of the RMS Titanic two days earlier.","date":"20 June","sources":["https://www.bbc.co.uk/news/uk-65955554"]}]