[{"content":"The Parliamentary Commissioner for Standards recommends that MP Chris Pincher be suspended for eight weeks, following an investigation into groping allegations.","date":"6 July","sources":["https://www.bbc.co.uk/news/live/uk-politics-66115262"]},{"content":"David Black, the chief executive of Ofwat, suggests that water bills are likely to rise in 2025 as water companies seek to cover the cost of improving services.","date":"5 July","sources":["https://www.bbc.co.uk/news/business-66106909"]},{"content":"The Ministry of Defence confirms that UK Special Forces are at the centre of a war crimes investigation involving Afghanistan.","date":"5 July","sources":["https://www.bbc.co.uk/news/uk-66106980"]},{"content":"King Charles III is presented with the Honours of Scotland during a ceremony held at Edinburgh's St Giles Cathedral.","date":"5 July","sources":["https://www.bbc.co.uk/news/uk-scotland-65854216","https://www.bbc.co.uk/news/uk-scotland-66098124"]},{"content":"Partygate scandal: The Metropolitan Police announces it is reopening its investigation into a lockdown party held at Conservative Party Headquarters in December 2020, as well as an event held at Westminster on 8 December 2020.","date":"4 July","sources":["https://www.bbc.co.uk/news/uk-politics-66103922"]},{"content":"The average interest rate on a five-year fixed mortgage deal exceeds 6%.","date":"4 July","sources":["https://www.bbc.co.uk/news/business-66088718"]},{"content":"The Met Office confirms that the UK has experienced its hottest June on record, with June 2023's average temperature of 15.8°C beating previous records from 1940 and 1976 by 0.9°C.","date":"3 July","sources":["https://www.bbc.co.uk/news/science-environment-66084543"]},{"content":"Train drivers belonging to the ASLEF union at 16 train operators begin a six-day overtime ban, threatening disruption to services.","date":"3 July","sources":["https://www.bbc.co.uk/news/business-66059122"]},{"content":"Orkney Islands Council begins movements to change its status, looking at options including becoming either a British Crown Dependency, or a British Overseas Territory of the United Kingdom, or a self-governing territory within the Kingdom of Norway or Denmark.","date":"2 July","sources":["https://www.bbc.co.uk/news/uk-scotland-north-east-orkney-shetland-66066448"]},{"content":"Co-op Funeralcare announces that resomation, a process that uses potassium hydroxide and water to break down human remains, will be made available for funerals in the UK for the first time later in the year.","date":"2 July","sources":["https://www.bbc.co.uk/news/uk-66081058"]}]