[{"content":"16 June - African leaders led by South African president Cyril Ramaphosa arrive at Kyviv to meet Zelensky on a peace mission. The seven leaders are then expected to travel to Moscow to meet Putin.","date":"","sources":["https://www.bbc.com/news/live/world-europe-65918754"]},{"content":"Moldova and Ukraine sign an agreement to build a bridge across their border over the Dniester river between Cosăuți, Moldova, and Yampil, Ukraine, bypassing the unrecognised state of Transnistria.","date":"12 June","sources":["https://news.yahoo.com/ukraine-moldova-construct-bridge-across-144900894.html"]},{"content":"Thousands of civilians are being evacuated from the town of Nova Kakhovka and surrounding villages as the floods spread.","date":"6 June –","sources":["https://www.bbc.com/news/world-europe-65819591"]},{"content":"The Nova Kakhovka dam in the Russian-occupied part of Ukraine's Kherson Oblast is destroyed, releasing a huge amount of water downstream on the Dnieper. The dam had held back 18 cubic kilometres of water in the Kakhovka reservoir.","date":"6 June –","sources":["https://www.reuters.com/world/europe/what-is-kakhovka-dam-ukraine-what-happened-2023-06-07/"]},{"content":"Ukraine officially joins NATO's Cooperative Cyber Defence Centre of Excellence.","date":"16 May","sources":["https://www.pravda.com.ua/eng/news/2023/05/16/7402456/"]},{"content":"Ukrainian President Volodymyr Zelenskyy meets with British Prime Minister Rishi Sunak at Chequers.","date":"15 May","sources":["https://www.bbc.co.uk/news/live/world-europe-65595035"]},{"content":"Ukrainian President Volodymyr Zelenskyy meets with German Chancellor Olaf Scholz in Berlin, Germany.","date":"14 May","sources":["https://www.bbc.com/news/world-europe-65588111"]},{"content":"Ukrainian President Volodymyr Zelenskyy meets with Pope Francis during a private audience in the Vatican.","date":"13 May","sources":["https://www.bbc.com/news/world-europe-65581170"]},{"content":"Russian nationalist writer Zakhar Prilepin is injured and his driver is killed when their vehicle is hit by a car bomb in Nizhny Novgorod Oblast, Russia.","date":"6 May","sources":["https://www.bbc.com/news/world-europe-65509809"]},{"content":"The Ukrainian government invites Brazilian President Luiz Inácio Lula da Silva to visit Ukraine and criticizes Lula for his approach to the conflict. Russian Foreign Minister Sergei Lavrov welcomes Lula's position on peace efforts.","date":"18 April –","sources":["https://www.reuters.com/world/ukraine-invites-brazils-lula-visit-criticizes-his-peace-efforts-2023-04-18/"]}]