[{"content":"The Sun prints fresh allegations about an unnamed BBC presenter, alleging that he stripped down to his underpants during a video call to the girl. Several male public figures associated with the BBC speak out to say they are not the individual concerned. Culture Secretary Lucy Frazer holds an urgent meeting with BBC Director General Tim Davie at which he tells her the BBC is investigating the matter \"swiftly and sensitively\". The BBC subsequently confirms it has suspended the presenter and referred the matter to the police.","date":"9 July","sources":["https://www.bbc.co.uk/news/entertainment-arts-66145747","https://www.independent.co.uk/news/uk/home-news/bbc-presenter-accused-rumours-off-air-b2371988.html","https://www.bbc.co.uk/news/entertainment-arts-66147003","https://www.telegraph.co.uk/news/2023/07/09/bbc-presenter-suspended-accused-paying-teen-explicit-images/"]},{"content":"Thunderstorms affect parts of the UK as a brief hot spell comes to an end.","date":"8 July","sources":["https://www.bbc.co.uk/news/uk-66132649"]},{"content":"Rishi Sunak reaffirms the UK's opposition to the use of cluster munitions, as the United States announces it will send the widely banned weapons to Ukraine, where the conflict has reached its 500th day.","date":"8 July","sources":["https://www.theguardian.com/world/live/2023/jul/08/russia-ukraine-war-live-ukraine-makes-tactically-significant-gains-in-bakhmut-says-us-thinktank-as-war-enters-500th-day","https://www.bbc.co.uk/news/uk-66142554"]},{"content":"A story printed in The Sun alleges that an unnamed BBC presenter paid a girl aged 17 for sexually explicit photos. In response the BBC says it is investigating and that the presenter is not scheduled to be on air in the coming days.","date":"7 July","sources":["https://www.bbc.co.uk/news/entertainment-arts-66140356"]},{"content":"Empire Cinemas collapses into administration, with the immediate closure of six of its outlets and the remainder at risk of closure.","date":"7 July","sources":["https://www.bbc.co.uk/news/business-66134084"]},{"content":"Following his trial and conviction at Nottingham Crown Court, Jamie Barrow is sentenced to life imprisonment with a minimum term of 44 years for the murders of a mother and her two children, who died after he set their flat on fire.","date":"7 July","sources":["https://www.bbc.co.uk/news/uk-england-nottinghamshire-66135038"]},{"content":"A man in his 20s, known publicly only as LXB, becomes the first alleged neo-Nazi in the UK to be placed under special government powers for monitoring and controlling suspected terrorists.","date":"7 July","sources":["https://www.bbc.co.uk/news/uk-66133530"]},{"content":"Data published by Halifax Bank indicates that UK house prices have fallen at the fastest rate since 2011, with a 2.6% fall in the last year.","date":"7 July","sources":["https://www.bbc.co.uk/news/business-66130798"]},{"content":"Consumer finance expert Martin Lewis speaks to BBC Radio 4 about the growing use of deepfake AI technology, warning that more regulation is needed to prevent online scams.","date":"7 July","sources":["https://www.bbc.co.uk/news/uk-66130785"]},{"content":"Wallasey pub shooting: Connor Chapman is found guilty of shooting dead 26-year-old Elle Edwards and injuring four others with a submachine gun. Co-defendant Thomas Waring is also found guilty of possessing a prohibited firearm and assisting an offender. The following day, Chapman is sentenced to a minimum of 48 years in prison, and Waring is given a nine-year prison term.","date":"6 July","sources":["https://www.bbc.co.uk/news/uk-england-merseyside-66108449","https://www.bbc.co.uk/news/live/uk-66127866"]}]