[{"content":"The longest doctor's strike in NHS history begins, as junior doctors begin a five-day walkout over pay.","date":"13 July","sources":["https://www.theguardian.com/politics/live/2023/jul/13/doctors-strike-nhs-rishi-sunak-pay-uk-politics-live"]},{"content":"The Bank of England says that rising interest rates mean that mortgages for at least one million borrowers will rise by an average of £500 a month by the end of 2023.","date":"12 July","sources":["https://www.bbc.co.uk/news/business-66172954"]},{"content":"Following an investigation into the Edwards allegations the Metropolitan Police releases a statement to say detectives have determined no criminal offence has been committed.","date":"12 July","sources":["https://www.bbc.co.uk/news/uk-66180799"]},{"content":"Huw Edwards is identified by his wife as the BBC presenter being investigated for allegedly paying a 17-year-old for sexually explicit photos. His wife also says that Edwards is receiving in-patient hospital care after an episode of depression following the publication of the allegations.","date":"12 July","sources":["https://news.sky.com/story/huw-edwardss-wife-names-him-as-bbc-presenter-accused-of-paying-teen-for-explicit-pictures-report-12917735"]},{"content":"The average deal on a two-year fixed mortgage reaches 6.66%, the highest level since the financial crisis of 2008.","date":"11 July","sources":["https://www.bbc.co.uk/news/business-66153812"]},{"content":"A second young person comes forward to make allegations about the BBC presenter at the centre of a scandal, claiming that they were contacted by him on a dating app and sent abusive and threatening messages. The person, in their early 20s, also says they felt under pressure to meet up, although they did not do so.","date":"11 July","sources":["https://www.bbc.co.uk/news/entertainment-arts-66165766"]},{"content":"EasyJet announces the cancellation of 1,700 flights to and from Gatwick Airport during July, August and September, citing constraints on airspace in Europe and ongoing traffic control difficulties.","date":"10 July","sources":["https://www.bbc.co.uk/news/business-66153416"]},{"content":"A lawyer representing the young person who was allegedly paid by a BBC presenter for indecent photographs casts doubt on the story. In a letter to the BBC, the lawyer says that his client contacted The Sun on 7 July to tell the newspaper there was \"no truth in it\". The paper is said to have subsequently printed the \"inappropriate article\" containing allegations made by the client's mother.","date":"10 July","sources":["https://www.bbc.co.uk/news/entertainment-arts-66159357"]},{"content":"The Sun prints fresh allegations about an unnamed BBC presenter, alleging that he stripped down to his underpants during a video call to the teenager. Several male public figures associated with the BBC speak out to say they are not the individual concerned. Culture Secretary Lucy Frazer holds an urgent meeting with BBC Director General Tim Davie at which he tells her the BBC is investigating the matter \"swiftly and sensitively\". The BBC subsequently confirms it has suspended the presenter and referred the matter to the police.","date":"9 July","sources":["https://www.bbc.co.uk/news/entertainment-arts-66145747","https://www.independent.co.uk/news/uk/home-news/bbc-presenter-accused-rumours-off-air-b2371988.html","https://www.bbc.co.uk/news/entertainment-arts-66147003","https://www.telegraph.co.uk/news/2023/07/09/bbc-presenter-suspended-accused-paying-teen-explicit-images/"]},{"content":"Thunderstorms affect parts of the UK as a brief hot spell comes to an end.","date":"8 July","sources":["https://www.bbc.co.uk/news/uk-66132649"]}]