[{"content":"Wallasey pub shooting: Connor Chapman is found guilty of shooting dead 26-year-old Elle Edwards and injuring four others with a submachine gun. Co-defendant Thomas Waring is also found guilty of possessing a prohibited firearm and assisting an offender.","date":"6 July","sources":["https://www.bbc.co.uk/news/uk-england-merseyside-66108449"]},{"content":"The government loses a High Court bid to prevent the COVID-19 Inquiry from seeing Boris Johnson's diaries and WhatsApp messages in full.","date":"6 July","sources":["https://www.bbc.co.uk/news/live/uk-politics-66115262"]},{"content":"One child dies, while 16 are injured after a Land Rover hits a primary school in Wimbledon, south-west London. The crash is not treated as terror-related, but the driver is arrested on suspicion of causing death by dangerous driving.","date":"6 July","sources":["https://www.bbc.co.uk/news/live/uk-66120180"]},{"content":"The Parliamentary Commissioner for Standards recommends that MP Chris Pincher be suspended for eight weeks, following an investigation into groping allegations.","date":"6 July","sources":["https://www.bbc.co.uk/news/live/uk-politics-66115262"]},{"content":"Threads is launched by Meta as a direct competitor to Twitter.","date":"6 July","sources":["https://www.theguardian.com/technology/2023/jul/06/meta-launches-twitter-rival-threads-in-100-countries"]},{"content":"David Black, the chief executive of Ofwat, suggests that water bills are likely to rise in 2025 as water companies seek to cover the cost of improving services.","date":"5 July","sources":["https://www.bbc.co.uk/news/business-66106909"]},{"content":"The Ministry of Defence confirms that UK Special Forces are at the centre of a war crimes investigation involving Afghanistan.","date":"5 July","sources":["https://www.bbc.co.uk/news/uk-66106980"]},{"content":"King Charles III is presented with the Honours of Scotland during a ceremony held at Edinburgh's St Giles Cathedral.","date":"5 July","sources":["https://www.bbc.co.uk/news/uk-scotland-65854216","https://www.bbc.co.uk/news/uk-scotland-66098124"]},{"content":"Partygate scandal: The Metropolitan Police announces it is reopening its investigation into a lockdown party held at Conservative Party Headquarters in December 2020, as well as an event held at Westminster on 8 December 2020.","date":"4 July","sources":["https://www.bbc.co.uk/news/uk-politics-66103922"]},{"content":"The average interest rate on a five-year fixed mortgage deal exceeds 6%.","date":"4 July","sources":["https://www.bbc.co.uk/news/business-66088718"]}]