[{"content":"A report published by the Intelligence and Security Committee of Parliament says the UK failed to develop an effective strategy for dealing with threats to its national security by China, which has allowed Chinese intelligence to aggressively target the UK.","date":"13 July","sources":["https://www.bbc.co.uk/news/uk-66189243"]},{"content":"The government offers more than a million public sector workers in England and Wales a pay rise worth an average of 6%. The offer sees police and prison officers in England and Wales offered 7%, with teachers in England offered 6.5%, and junior doctors in England offered 6%.","date":"13 July","sources":["https://www.bbc.co.uk/news/uk-politics-66188500"]},{"content":"The longest doctor's strike in NHS history begins, as junior doctors begin a five-day walkout over pay.","date":"13 July","sources":["https://www.theguardian.com/politics/live/2023/jul/13/doctors-strike-nhs-rishi-sunak-pay-uk-politics-live"]},{"content":"The 2.6 GW Hornsea Project 4 is approved by the government, becoming the second-largest UK wind farm to receive planning consent, following Hornsea Project Three.","date":"12 July","sources":["https://www.theguardian.com/environment/2023/jul/12/hornsey-four-offshore-windfarm-given-green-light-after-five-month-delay"]},{"content":"The Bank of England says that rising interest rates mean that mortgages for at least one million borrowers will rise by an average of £500 a month by the end of 2023.","date":"12 July","sources":["https://www.bbc.co.uk/news/business-66172954"]},{"content":"Following an investigation into the Edwards allegations the Metropolitan Police releases a statement to say detectives have determined no criminal offence has been committed.","date":"12 July","sources":["https://www.bbc.co.uk/news/uk-66180799"]},{"content":"Huw Edwards is identified by his wife as the BBC presenter being investigated for allegedly paying a 17-year-old for sexually explicit photos. His wife also says that Edwards is receiving in-patient hospital care after an episode of depression following the publication of the allegations.","date":"12 July","sources":["https://news.sky.com/story/huw-edwardss-wife-names-him-as-bbc-presenter-accused-of-paying-teen-for-explicit-pictures-report-12917735"]},{"content":"The average deal on a two-year fixed mortgage reaches 6.66%, the highest level since the financial crisis of 2008.","date":"11 July","sources":["https://www.bbc.co.uk/news/business-66153812"]},{"content":"A second young person comes forward to make allegations about the BBC presenter at the centre of a scandal, claiming that they were contacted by him on a dating app and sent abusive and threatening messages. The person, in their early 20s, also says they felt under pressure to meet up, although they did not do so.","date":"11 July","sources":["https://www.bbc.co.uk/news/entertainment-arts-66165766"]},{"content":"EasyJet announces the cancellation of 1,700 flights to and from Gatwick Airport during July, August and September, citing constraints on airspace in Europe and ongoing traffic control difficulties.","date":"10 July","sources":["https://www.bbc.co.uk/news/business-66153416"]}]