[{"content":"Train drivers belonging to the ASLEF union at 16 train operators begin a six-day overtime ban, threatening disruption to services.","date":"3 July","sources":["https://www.bbc.co.uk/news/business-66059122"]},{"content":"Orkney Islands Council begins movements to change its status, looking at options including becoming either a British Crown Dependency, or a British Overseas Territory of the United Kingdom, or a self-governing territory within the Kingdom of Norway or Denmark.","date":"2 July","sources":["https://www.bbc.co.uk/news/uk-scotland-north-east-orkney-shetland-66066448"]},{"content":"Co-op Funeralcare announces that resomation, a process that uses potassium hydroxide and water to break down human remains, will be made available for funerals in the UK for the first time later in the year.","date":"2 July","sources":["https://www.bbc.co.uk/news/uk-66081058"]},{"content":"The Public Order Act 2023 comes into effect in England and Wales, giving police greater powers to move environmental protestors who disrupt transport routes.","date":"2 July","sources":["https://www.bbc.co.uk/news/uk-66079436"]},{"content":"The price cap on energy bills is reduced, with an average yearly domestic gas and electricity bill falling by £426 to £2,074.","date":"1 July","sources":["https://www.bbc.co.uk/news/business-66030365"]},{"content":"The Foreign Office issues a travel warning for Britons going to France, as major riots grip the country.","date":"1 July","sources":["https://www.bbc.co.uk/news/uk-66073996"]},{"content":"The Independent Press Standards Organisation rules that a December 2022 column in The Sun newspaper written by Jeremy Clarkson about Meghan, Duchess of Sussex being paraded naked through the streets was sexist, but rejects complaints that it was either discriminatory on the grounds of race, inaccurate, or sought to harass the duchess. Both The Sun and Clarkson had apologised for the piece in December 2022.","date":"30 June","sources":["https://www.bbc.co.uk/news/entertainment-arts-64489083"]},{"content":"Sunak unveils an NHS workforce plan that aims to address shortages in the health service by increasing the number of training places for nurses and doctors, as well as retaining them in the NHS workforce.","date":"30 June","sources":["https://www.bbc.co.uk/news/health-66052274"]},{"content":"Smoke from record-breaking Canadian wildfires is detected in the UK, having drifted thousands of kilometres over the Atlantic.","date":"29 June","sources":["https://www.bbc.co.uk/news/uk-66058108"]},{"content":"The plan to deport some asylum seekers to Rwanda is ruled unlawful. In a three-judge decision, the court of appeal overturns a high court decision that previously ruled that Rwanda could be considered a safe third country to send refugees.","date":"29 June","sources":["https://www.aljazeera.com/news/2023/6/29/uk-appeal-court-rules-rwanda-deportation-plan-unlawful"]}]